app/controllers/calendar_controller.rb

SELECT * FROM `events` WHERE ((start_date >= '2017-04-01' and end_date <= '2017-04-30') or (start_date <= '2017-04-01' and end_date <= '2017-04-30') or (start_date>='2017-04-01' and end_date>='2017-04-30') or (start_date<='2017-04-01' and end_date>='2017-04-30') )
---
  def index
    @user = current_user
    if params[:new_month].nil?
      @show_month = @local_tzone_time.to_date
    else
      d = params[:new_month].to_i
      passed_date = (params[:passed_date]).to_date
      if params[:new_month].to_i > passed_date.month
        @show_month  = passed_date+1.month
      else
        @show_month = passed_date-1.month
      end
    end
    @start_date = @show_month.beginning_of_month
    @start_date_day = @start_date.wday
    @last_day = @show_month.end_of_month
    @notifications = Hash.new{|h,k| h[k]=Array.new}
    first_day = @show_month.beginning_of_month
    last_day =  @show_month.end_of_month
    @events = Event.find(:all,:conditions => ["(start_date >= ? and end_date <= ?) or (start_date <= ? and end_date <= ?)  or (start_date>=? and end_date>=?) or (start_date<=? and end_date>=?) ", first_day, last_day, first_day,last_day, first_day,last_day,first_day,last_day])

SELECT * FROM `events` WHERE ((start_date >= '2017-05-01' and end_date <= '2017-05-31') or (start_date <= '2017-05-01' and end_date <= '2017-05-31') or (start_date>='2017-05-01' and end_date>='2017-05-31') or (start_date<='2017-05-01' and end_date>='2017-05-31') )
---
  def new_calendar
    @user = current_user
    d = params[:new_month].to_i
    passed_date = (params[:passed_date]).to_date
    if params[:new_month].to_i > passed_date.month
      @show_month  = passed_date+1.month
    else
      @show_month = passed_date-1.month
    end
    @start_date = @show_month.beginning_of_month
    @start_date_day = @start_date.wday
    @last_day = @show_month.end_of_month
    @notifications = Hash.new{|h,k| h[k]=Array.new}
    first_day = @show_month.beginning_of_month
    last_day =  @show_month.end_of_month
    @events = Event.find(:all,:conditions => ["(start_date >= ? and end_date <= ?) or (start_date <= ? and end_date <= ?)  or (start_date>=? and end_date>=?) or (start_date<=? and end_date>=?) ", first_day, last_day, first_day,last_day, first_day,last_day,first_day,last_day])

SELECT * FROM `events` WHERE ((start_date >= '2017-04-01 00:00:00' and end_date <= '2017-04-30 00:00:00') or (start_date <= '2017-04-01 00:00:00' and end_date <= '2017-04-30 00:00:00') or (start_date>='2017-04-01 00:00:00' and end_date>='2017-04-30 00:00:00') or (start_date<='2017-04-01 00:00:00' and end_date>='2017-04-30 00:00:00') ) AND (`events`.`is_exam` = 1 AND `events`.`is_common` = 0 AND `events`.`is_holiday` = 0)
SELECT * FROM `batch_events` WHERE (event_id = 1) AND (`batch_events`.`batch_id` = 1) LIMIT 1
---
  def show_exam_event_tooltip
    @user = current_user
    @date = params[:id].to_date
    first_day = @date.beginning_of_month.to_time
    last_day = @date.end_of_month.to_time
    not_common_exam_event = Event.find_all_by_is_common_and_is_holiday_and_is_exam(false,false,true, :conditions => ["(start_date >= ? and end_date <= ?) or (start_date <= ? and end_date <= ?)  or (start_date>=? and end_date>=?) or (start_date<=? and end_date>=?) ", first_day, last_day, first_day,last_day, first_day,last_day,first_day,last_day])
    not_common_exam_event.reject! { |x|x.origin.nil?  }
    @student_batch_exam_event_array = []
    if @user.student == true or @user.parent == true
      user_student = @user.student_record if @user.student
      user_student = @user.parent_record if @user.parent
      batch = user_student.batch
      not_common_exam_event.each do |h|
        student_batch_exam_event = BatchEvent.find_by_batch_id(batch.id, :conditions=>"event_id = #{h.id}")

SELECT * FROM `events` WHERE ( events.start_date >= '2017-04-22 00:00:00' AND events.start_date <= '2017-04-22 23:59:59') AND (`events`.`is_due` = 1)
SELECT * FROM `students` WHERE (`students`.user_id = 2) LIMIT 1
SELECT * FROM `user_events` WHERE (`user_events`.event_id = 3)
---
  def show_due_tooltip
    @user = current_user
    @date = params[:id].to_date
    finance_due_check = Event.find_all_by_is_due(true,true, :conditions => " events.start_date >= '#{@date.strftime("%Y-%m-%d 00:00:00")}' AND events.start_date <= '#{@date.strftime("%Y-%m-%d 23:59:59")}'")
    finance_due_check.reject!{|x| !x.is_active_event }
    if @user.student? or @user.parent?
      finance_due_check.reject!{|x| !x.is_student_event(@user.student_record) } if @user.student
      finance_due_check.reject!{|x| !x.is_student_event(@user.parent_record) } if @user.parent
    elsif @user.employee?
      finance_due_check.reject!{|x| !x.is_employee_event(@user) }
    end
    @finance_due = []
    finance_due_check.each do |h|

SELECT * FROM `batch_events` WHERE (event_id = 1) AND (`batch_events`.`batch_id` = 1) LIMIT 1
---
            build_common_events_hash(e,'student_batch_exam',@show_month)
          end
          if @user.admin?
            student_batch_exam_event = BatchEvent.find(:all, :conditions=>"event_id = #{e.id}")