app/controllers/class_designations_controller.rb

  def load_class_designations
    unless params[:course_id]==""
      @course = Course.find(params[:course_id])
      @class_designations = ClassDesignation.find(:all,:conditions=>{:course_id=>@course.id})
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `class_designations` WHERE (`class_designations`.`course_id` = 1)

  def create_class_designation
    @course = Course.find(params[:course_id])
    @class_designation = ClassDesignation.new(params[:class_designation])
    @class_designation.course_id = @course.id
    if @class_designation.save
---
INSERT INTO `class_designations` (`name`, `created_at`, `updated_at`, `course_id`, `cgpa`, `marks`) VALUES('class 1', '2017-04-17 15:57:45', '2017-04-17 15:57:45', 1, NULL, 45.0)