app/controllers/configuration_controller.rb

  def settings
    @config = Configuration.get_multiple_configs_as_hash ['InstitutionName', 'InstitutionAddress', 'InstitutionPhoneNo', \
        'StudentAttendanceType', 'CurrencyType', 'ExamResultType', 'AdmissionNumberAutoIncrement','EmployeeNumberAutoIncrement', \
        'NetworkState','Locale','FinancialYearStartDate','FinancialYearEndDate','EnableNewsCommentModeration','DefaultCountry','TimeZone']
    @grading_types = Course::GRADINGTYPES
    @enabled_grading_types = Configuration.get_grading_types
    @time_zones = TimeZone.all
    @school_detail = SchoolDetail.first || SchoolDetail.new
    @countries=Country.all
    if request.post?
      Configuration.set_config_values(params[:configuration])
      session[:language] = nil unless session[:language].nil?
      @school_detail.logo = params[:school_detail][:school_logo] if params[:school_detail].present?
      unless @school_detail.save
---
SELECT * FROM `time_zones`
SELECT * FROM `school_details` LIMIT 1
SELECT * FROM `countries`
INSERT INTO `school_details` (`created_at`, `updated_at`, `logo_file_name`, `logo_content_type`, `logo_file_size`, `school_id`) VALUES('2017-04-17 17:40:00', '2017-04-17 17:40:00', NULL, NULL, NULL, NULL)