app/controllers/courses_controller.rb

INSERT INTO `courses` (`created_at`, `code`, `updated_at`, `course_name`, `is_deleted`, `section_name`, `grading_type`) VALUES('2017-04-17 14:40:56', 'Class 1', '2017-04-17 14:40:56', 'Class 1', 0, 'Class 1', '0')
---
  def create
    @course = Course.new params[:course]
    if @course.save